import slide2 from "@/assets/images/candle.jpeg";
import slide1 from "@/assets/images/crest.jpg";
import slide3 from "@/assets/images/icon.jpg";
import slide4 from "@/assets/images/riassa.jpg";

import { ISliderModel } from "@/common/types";

export const sliderData: ISliderModel[] = [
  {
    title: "Хрест ",
    id: 1,
    image: slide1,
    description:
      "Це один з головних символів православ'я. Він використовується як обрядовий предмет і символізує жертву Ісуса Христа. Хрести можуть бути виготовлені з дерева, металу або інших матеріалів і носяться як оберег або прикраса.",
  },
  {
    title: "Свічка",
    id: 2,
    image: slide2,
    description:
      "У православній церкві свічка використовується для молитви та вшанування. Віряни розміщують свічки перед іконами та на алтарі, щоб вони символізували світло віри та молитви, які піднімаються до небес.",
  },
  {
    title: "Ікони",
    id: 3,
    image: slide3,
    description:
      "Це священні зображення, які мають особливе значення для віруючих у православній традиції. Вони намальовані на дереві або папері, іноді виготовлені з металу або навіть каменю.",
  },
  {
    title: "Ряса",
    id: 4,
    image: slide4,
    description:
      "Це одяг священика у православній церкві, який він носить під час богослужінь та інших церковних обрядів. Ряса може бути прикрашена вишивкою або хрестами, що символізує духовну скромність та благоговіння. ",
  },
];
